Documents/упСписаниеПлановПоЗаданиюНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упСписаниеПлановПоЗаданиюНаПеревозку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упСостояниеПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упСтатусыЗаданияНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗаданияНаПеревозкуГруза</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПланированию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключеноВРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упСписаниеПлановПоЗаданиюНаПеревозку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формируется или открывается существующий документ "Списание планов по заданию на перевозку" на основании задания на перевозку 
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  ТекстОшибки  - Строка - Текстовое представлениеошибки.
//  Отказ  - Булево - Флаг что произошел отказ создания движения.
//
// Возвращаемое значение:
//   ДокументСсылка   - Ссылка на документ.
//
Функция СформироватьСписаниеПлановПоЗаданиюНаПеревозку(ЗаданиеНаПеревозку, ТекстОшибки = Неопределено, Отказ) Экспорт
	
	Результат = Неопределено;
	
	СтатусЗадания = упРаботаСоСтатусами.ПолучитьТекущийСтатус(ЗаданиеНаПеревозку);
	
	Если Ложь
		Или СтатусЗадания = Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Новое
		Или СтатусЗадания = Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Выполнено
		Или СтатусЗадания = Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Отменено
	Тогда
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(Нстр("ru = 'Запрещено формировать списание планов по заданию в статусе ""%1""'"), СтатусЗадания);
		ТекстОшибкиДляЖР = ТекстОшибки;
		ЗаписьЖурналаРегистрации(упЗаданиеНаПеревозку.СобытиеОшибкаСписаниеПлановПоЗаданиюНаПеревозку(НСтр("ru = 'Добавление'")), УровеньЖурналаРегистрации.Предупреждение, ,ЗаданиеНаПеревозку, ТекстОшибкиДляЖР, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	КонецЕсли;
	
	Если Не Отказ Тогда
		НовыйДокумент = Документы.упСписаниеПлановПоЗаданиюНаПеревозку.СоздатьДокумент();
		НовыйДокумент.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		НовыйДокумент.ИсточникСозданияОбъекта = упСервисныеФункцииКлиентСервер.ИсточникСозданияОбъекта();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.ЗаданиеНаПеревозку = ЗаданиеНаПеревозку;
		НовыйДокумент.Заполнить(ЗаданиеНаПеревозку);
		НовыйДокумент.ДополнительныеСвойства.Вставить("ВыводитьСообщенияПользователю", Ложь);
		Попытка
			НовыйДокумент.Записать();
			Результат = НовыйДокумент.Ссылка;
		Исключение
			ТекстОшибкиДляЖР = "";
			Отказ = Истина;
			упСервисныеФункции.ПредставленияОписанияОшибки(НовыйДокумент, ТекстОшибки, ТекстОшибкиДляЖР);
			ЗаписьЖурналаРегистрации(упЗаданиеНаПеревозку.СобытиеОшибкаСписаниеПлановПоЗаданиюНаПеревозку(НСтр("ru = 'Добавление'")), УровеньЖурналаРегистрации.Ошибка, ,ЗаданиеНаПеревозку, ТекстОшибкиДляЖР, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции // СформироватьСписаниеПлановПоЗаданиюНаПеревозку()

#КонецОбласти

Функция ДоступныеСтатусыЗаданийДляОснования() Экспорт
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.КПланированию);
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.ВключеноВРейс);
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.КВыполнению);
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Выполняется);
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.ВПути);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
